package test;
/*4. Создать консольное приложение
корзина, в корзину  можно добавлять продукты а затем выводить их все в консоль
 */
import java.util.Scanner;
import java.util.*;
public class Task4 {
    public static void main(String[] args) {
            System.out.println("Добавьте продукты: ");
            Scanner scan = new Scanner(System.in);
            String product = scan.nextLine();
            System.out.println("В корзине: " + product);

        }
    }





